## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.fatp_azure_web_app_services_hosting.azurerm_linux_web_app.default[0] has changed
  ~ resource "azurerm_linux_web_app" "default" {
        id                                = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-379/providers/Microsoft.Web/sites/find-a-tp-pr-379"
        name                              = "find-a-tp-pr-379"
        tags                              = {
            "Environment"      = "pr-379"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (19 unchanged attributes hidden)

      ~ identity {
          + identity_ids = []
            # (3 unchanged attributes hidden)
        }

      ~ site_config {
          ~ ip_restriction                          = [
              ~ {
                  ~ headers                   = [
                      ~ {
                          + x_fd_health_probe = []
                          + x_forwarded_for   = []
                          + x_forwarded_host  = []
                            # (1 unchanged attribute hidden)
                        },
                    ]
                    name                      = "Allow CDN Traffic"
                    # (5 unchanged attributes hidden)
                },
            ]
            # (24 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_storage_account.logs[0] has changed
  ~ resource "azurerm_storage_account" "logs" {
        id                                = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-379/providers/Microsoft.Storage/storageAccounts/findatppr379logs"
        name                              = "findatppr379logs"
        tags                              = {
            "Environment"      = "pr-379"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (37 unchanged attributes hidden)

      ~ network_rules {
          ~ default_action             = "Allow" -> "Deny"
          ~ ip_rules                   = [
              + "172.177.129.240",
              + "20.126.142.17",
            ]
          ~ virtual_network_subnet_ids = [
              + "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-379/providers/Microsoft.Network/virtualNetworks/find-a-tp-pr-379-default/subnets/find-a-tp-pr-379-webappserviceinfra",
            ]
            # (1 unchanged attribute hidden)

          + private_link_access {
              + endpoint_resource_id = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-379/providers/Microsoft.Web/sites/find-a-tp-pr-379"
              + endpoint_tenant_id   = "9c7d9dd3-840c-4b3f-818e-552865082e16"
            }
        }

        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.fatp_azure_web_app_services_hosting.data.azurerm_storage_account_blob_container_sas.logs["app"] will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_storage_account_blob_container_sas" "logs" {
      + connection_string = (sensitive value)
      + container_name    = "find-a-tp-pr-379applogs"
      + expiry            = (known after apply)
      + https_only        = true
      + id                = (known after apply)
      + sas               = (sensitive value)
      + start             = (known after apply)

      + permissions {
          + add    = true
          + create = true
          + delete = true
          + list   = true
          + read   = true
          + write  = true
        }
    }

  # module.fatp_azure_web_app_services_hosting.data.azurerm_storage_account_blob_container_sas.logs["http"] will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_storage_account_blob_container_sas" "logs" {
      + connection_string = (sensitive value)
      + container_name    = "find-a-tp-pr-379httplogs"
      + expiry            = (known after apply)
      + https_only        = true
      + id                = (known after apply)
      + sas               = (sensitive value)
      + start             = (known after apply)

      + permissions {
          + add    = true
          + create = true
          + delete = true
          + list   = true
          + read   = true
          + write  = true
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_key_vault_secret.fatpdbconnectionstring will be created
  + resource "azurerm_key_vault_secret" "fatpdbconnectionstring" {
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-379/providers/Microsoft.KeyVault/vaults/find-a-tp-pr-379-kv"
      + name                    = "ConnectionStrings--FatpDatabase"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_linux_web_app.default[0] will be updated in-place
  ~ resource "azurerm_linux_web_app" "default" {
        id                                = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-379/providers/Microsoft.Web/sites/find-a-tp-pr-379"
        name                              = "find-a-tp-pr-379"
        tags                              = {
            "Environment"      = "pr-379"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (19 unchanged attributes hidden)

      ~ logs {
            # (2 unchanged attributes hidden)

          ~ application_logs {
                # (1 unchanged attribute hidden)

              ~ azure_blob_storage {
                  ~ sas_url           = (sensitive value)
                    # (2 unchanged attributes hidden)
                }
            }

          ~ http_logs {
              ~ azure_blob_storage {
                  ~ sas_url           = (sensitive value)
                    # (1 unchanged attribute hidden)
                }
            }
        }

      ~ site_config {
          ~ worker_count                            = 1 -> 3
            # (24 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_diagnostic_setting.web_app[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "web_app" {
        id                             = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-379/providers/Microsoft.Storage/storageAccounts/findatppr379logs|find-a-tp-pr-379-storage-diag"
      + log_analytics_destination_type = "Dedicated"
        name                           = "find-a-tp-pr-379-storage-diag"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "Capacity" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - metric {
          - category = "Transaction" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      + metric {
          + category = "Transaction"
          + enabled  = true

          + retention_policy {
              + enabled = false
            }
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_postgresql_flexible_server.default will be created
  + resource "azurerm_postgresql_flexible_server" "default" {
      + administrator_login           = "fatpadmin"
      + administrator_password        = (sensitive value)
      + backup_retention_days         = 35
      + fqdn                          = (known after apply)
      + geo_redundant_backup_enabled  = false
      + id                            = (known after apply)
      + location                      = "westeurope"
      + name                          = "find-a-tp-pr-379-psqlflexible-server"
      + private_dns_zone_id           = (known after apply)
      + public_network_access_enabled = (known after apply)
      + resource_group_name           = "s177d01-ntp-pr-379"
      + sku_name                      = "B_Standard_B1ms"
      + storage_mb                    = 32768
      + tags                          = {
          + "Environment"      = "pr-379"
          + "Product"          = "National Tutoring Programme"
          + "Service Offering" = "National Tutoring Programme"
        }
      + version                       = "14"
      + zone                          = "1"
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_postgresql_flexible_server_configuration.extensions[0] will be created
  + resource "azurerm_postgresql_flexible_server_configuration" "extensions" {
      + id        = (known after apply)
      + name      = "azure.extensions"
      + server_id = (known after apply)
      + value     = "CITEXT,UUID-OSSP"
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_postgresql_flexible_server_database.default will be created
  + resource "azurerm_postgresql_flexible_server_database" "default" {
      + charset   = "utf8"
      + collation = "en_US.utf8"
      + id        = (known after apply)
      + name      = "find-a-tp-pr-379-db"
      + server_id = (known after apply)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_postgresql_flexible_server_firewall_rule.web_app_default_static_ip[0] will be created
  + resource "azurerm_postgresql_flexible_server_firewall_rule" "web_app_default_static_ip" {
      + end_ip_address   = "20.126.142.17"
      + id               = (known after apply)
      + name             = "find-a-tp-pr-379webapp"
      + server_id        = (known after apply)
      + start_ip_address = "20.126.142.17"
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_resource_group.default[0] will be updated in-place
  ~ resource "azurerm_resource_group" "default" {
        id       = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-379"
        name     = "s177d01-ntp-pr-379"
      ~ tags     = {
          ~ "Environment"      = "Dev" -> "pr-379"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (1 unchanged attribute hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_storage_account_network_rules.logs[0] will be updated in-place
  ~ resource "azurerm_storage_account_network_rules" "logs" {
        id                         = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-379/providers/Microsoft.Storage/storageAccounts/findatppr379logs"
      ~ ip_rules                   = [
          - "172.177.129.240",
            # (1 unchanged element hidden)
        ]
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 5 to add, 4 to change, 0 to destroy.
```
</details>